J0JIng/MDP-GRP13-2025/stm/STM32_MDP_Code/STM32_MDP_Code/Core/Src/app_motion.cpp
	    // Apply constant PWM
	    lmotor->setSpeed(speed, isFwd);
	    rmotor->setSpeed(speed, isFwd);

	    // F1-style side-to-side weaving while moving: sinusoidal steering
	    // safe defaults: frequency = 0.8 Hz, amplitude limited by SLIGHT deltas
	    const float weave_freq_hz = 0.8f; // cycles per second
	    const float TWO_PI = 6.28318530718f;
	    // map a small angular amplitude to PWM counts using a conservative gain
	    const float WEAVE_ANG_DEG = 6.0f; // degrees of steering swing
	    const float SERVO_WEAVE_GAIN = 1.0f; // pwm counts per degree
	    int32_t max_left = SLIGHT_LEFT_DELTA;
	    int32_t max_right = SLIGHT_RIGHT_DELTA;

	    uint32_t timeStart = HAL_GetTick();
	    while (HAL_GetTick() - timeStart < duration_ms) {
	        if (emergency) break;

	        // elapsed time in seconds
	        float t = (float)(HAL_GetTick() - timeStart) / 1000.0f;

	        // sinusoidal desired angle in degrees (-WEAVE_ANG_DEG .. +WEAVE_ANG_DEG)
	        float ang = WEAVE_ANG_DEG * sinf(TWO_PI * weave_freq_hz * t);

	        // convert to pwm offset
	        int32_t pwm_offset = (int32_t)(ang * SERVO_WEAVE_GAIN);

	        // clamp by side-specific slight deltas
	        if (pwm_offset > max_right) pwm_offset = max_right;
	        if (pwm_offset < -max_left) pwm_offset = -max_left;

	        uint32_t pwm_cmd = (uint32_t)((int32_t) CENTER_POS_PWM + pwm_offset);
	        servo->turnToPos(pwm_cmd);

	        osDelay(15); // small delay to allow smooth weaving and sensor updates
	        osThreadYield();
	    }

	    // Stop motors
	    lmotor->halt();
	    rmotor->halt();
	}

	void MotionController::move(bool isFwd, uint32_t arg, uint32_t speed, bool isCrawl, bool nostop) {
		emergency = false;
		sensor_data.is_moving = true;
		servo->turnFront();
		osDelay(300);
		lmotor->setSpeed(speed, isFwd);
		rmotor->setSpeed(speed, isFwd);

		// Caution Manual override !!!!
		//isCrawl = true;

		if (isCrawl)
		{
				lmotor->setSpeed(30, isFwd);
				rmotor->setSpeed(30, isFwd);
		}

		uint32_t dist_travelled = 0;
		uint32_t l_encoder_count = lencoder->getCount();
		uint32_t r_encoder_count = rencoder->getCount();
		double target = (double) arg / DISTANCE_PER_ENCODER_PULSE;

		if (!isFwd){
			target = target *2;
		}

		double cur_left = 0, cur_right = 0;
		float count_left = 0, count_right = 0;

		sensor_data.target = target;
		sensor_data.cur_left = cur_left;
		sensor_data.cur_right = cur_right;

//		 OLED_ShowString(0, 10, (uint8_t*)"Entered move()");
//		 OLED_Refresh_Gram();


		double speed_error = 0;
		// yaw correction helpers for this move
		bool _move_yaw_init = false;
		float _move_start_yaw = 0.0f;
		uint32_t _move_start_time = 0;
		float _prev_yaw = 0.0f;
		uint32_t _prev_yaw_time = 0;

		do {

//    		OLED_ShowString(0, 20, (uint8_t*)"looping...");
//			OLED_Refresh_Gram();

			count_left = (double) lencoder->getDelta(l_encoder_count, lencoder->getCount());
			count_right = (double) rencoder->getDelta(r_encoder_count, rencoder->getCount());


			cur_left += count_left * LEFT_ENCODER_SCALE;
			cur_right += count_right * RIGHT_ENCODER_SCALE;
			// update baseline counts so getDelta() returns per-iteration delta (avoid cumulative double-counting)
			l_encoder_count = lencoder->getCount();
			r_encoder_count = rencoder->getCount();
			speed_error += (count_left - count_right);

			// --- YAW-BASED MICRO-STEERING CORRECTION ---
			// initialize reference yaw at start of move
			if (!_move_yaw_init) {
				_move_start_yaw = sensor_data.yaw_abs;
				_move_start_time = HAL_GetTick();
				_prev_yaw = sensor_data.yaw_abs;
				_prev_yaw_time = sensor_data.yaw_abs_time ? sensor_data.yaw_abs_time : _move_start_time;
				_move_yaw_init = true;
			}

			// estimate instantaneous yaw rate and update global bias estimator
			{
				uint32_t now_time = HAL_GetTick();
				float yaw_now = sensor_data.yaw_abs;
				float dt = (float)( (sensor_data.yaw_abs_time && _prev_yaw_time) ? (sensor_data.yaw_abs_time - _prev_yaw_time) : (now_time - _prev_yaw_time)) / 1000.0f;
				if (dt > 0.001f) {
					float inst_rate = angDiff(yaw_now, _prev_yaw) / dt; // deg/sec
					// very slow low-pass to estimate bias
					g_yaw_drift_bias_dps = (g_yaw_drift_bias_dps * 0.995f) + (inst_rate * 0.005f);
				}
				_prev_yaw = yaw_now;
				_prev_yaw_time = sensor_data.yaw_abs_time ? sensor_data.yaw_abs_time : now_time;
			}

			// compute yaw error relative to expected biased reference
			float elapsed_s = (float)(HAL_GetTick() - _move_start_time) / 1000.0f;
			float expected_bias = g_yaw_drift_bias_dps * elapsed_s;
			float ref_yaw = _move_start_yaw + expected_bias;
			float yaw_error = angDiff(sensor_data.yaw_abs, ref_yaw); // deg, positive means rotated LEFT from ref (user convention)

			// convert yaw error to small servo PWM offset
			const float SERVO_YAW_GAIN = 2.0f; // PWM counts per degree (tune on robot)
			// use SLIGHT_LEFT_DELTA and SLIGHT_RIGHT_DELTA as micro-adjust caps
			int32_t max_left = SLIGHT_LEFT_DELTA; // positive offset to left is negative PWM offset
			int32_t max_right = SLIGHT_RIGHT_DELTA; // positive offset to right is positive PWM offset
			int32_t pwm_offset = (int32_t)(yaw_error * SERVO_YAW_GAIN); // positive yaw (left) -> positive pwm_offset -> steer right to compensate
			// clamp by side-specific slight deltas
			if (pwm_offset > max_right) {
				if (isFwd){
				pwm_offset = max_right;
				}
				else {
				pwm_offset = -max_right;
				}
			}
			if (pwm_offset < -max_left){
				if (isFwd){
					pwm_offset = -max_left;
				}
				else {pwm_offset = max_left;}
			}
			uint32_t pwm_cmd = (uint32_t)((int32_t) CENTER_POS_PWM + pwm_offset);
			// apply micro-adjustment without long blocking


			if (isFwd){
				servo->turnToPos(pwm_cmd);
			}


			if (!isCrawl && !nostop) {

				// Close to target check
				if (cur_left > target - 2000 || cur_right > target - 2000) {


					float pid_left = map(target - cur_left, 2000, 330, 35, 15);
					float pid_right = map(target - cur_left, 2000, 330, 35, 15);

					lmotor->setSpeed(pid_left, isFwd);
					rmotor->setSpeed(pid_right, isFwd);

