J0JIng/MDP-GRP13-2025/stm/STM32_MDP_Code/STM32_MDP_Code/Core/Src/app_motion.cpp
				}

				// Use PID
				else {

					float pid_left = PID_calc(&this->left_pid, target - cur_left, target);
					float pid_right = PID_calc(&this->right_pid, target - cur_right, target);
					float pid_left_d = PID_calc(&this->sync_left_pid, speed_error, 0);
					float pid_right_d = PID_calc(&this->sync_right_pid, -speed_error, 0);

					// Update the speed
					lmotor->_setDutyCycleVal((uint32_t) ((pid_left + pid_left_d) > 1000 ?(pid_left + pid_left_d) : 1000), isFwd);
					rmotor->_setDutyCycleVal((uint32_t) ((pid_right + pid_right_d) > 1000 ?(pid_right + pid_right_d) : 1000), isFwd);
				}
			}

			l_encoder_count = lencoder->getCount();
			r_encoder_count = rencoder->getCount();
			dist_travelled = (uint32_t) (cur_left>cur_right?cur_right:cur_left) * DISTANCE_PER_ENCODER_PULSE;
			sensor_data.last_halt_val = dist_travelled;

			if ((cur_left > target && cur_right > target) || emergency)
			{
				sensor_data.last_halt_val = (uint32_t) (cur_left>cur_right?cur_right:cur_left) * DISTANCE_PER_ENCODER_PULSE;
				sensor_data.cur_left = cur_left;
				sensor_data.cur_right = cur_right;
				lmotor->halt();
				rmotor->halt();
				break;
			}

			osDelay(10);
			sensor_data.cur_left = cur_left;
			sensor_data.cur_right = cur_right;
//			char buf[50];
//			snprintf(buf, sizeof(buf), "L:%3.2f R:%3.2f T:%3.2f", cur_left, cur_right, target);
//			OLED_ShowString(0, 30, (uint8_t*)buf);
//			OLED_Refresh_Gram();
			osThreadYield();

		} while (1);


		lmotor->halt();
		rmotor->halt();
		emergency = false;
		sensor_data.is_moving = false;
	}

	void MotionController::turn(bool isRight, bool isFwd, bool arc, uint32_t arg) {
		sensor_data.is_moving = true;
		emergency = false;

		// LAST MINUTE CHANGE
//		if (!isRight && !isFwd ){
//			MotionController::move(false, 5, 100,true, false);
//		    sensor_data.is_moving = true;
//		}
//
//		if (isRight && !isFwd ){
//			MotionController::move(false, 5, 100,true, false);
//		    sensor_data.is_moving = true;
//		}

		isRight ? servo->turnRight() : servo->turnLeft();
		isRight ? lmotor->setSpeed(51, isFwd) : lmotor->setSpeed(20, isFwd);
		isRight ? rmotor->setSpeed(20, isFwd) : rmotor->setSpeed(51, isFwd);

		if(arc) // arc increases turn radius
		{
			isRight ? lmotor->setSpeed(55, isFwd) : lmotor->setSpeed(20, isFwd);
			isRight ? rmotor->setSpeed(20, isFwd) : rmotor->setSpeed(55, isFwd);
		}
		uint32_t timeNow = HAL_GetTick();
		uint32_t timeStart = timeNow;
		uint8_t buf[30] = { 0 };
		float target_yaw = 0;
		float req = ((float) arg) ;
		float cur = sensor_data.yaw_abs; //[-179,180]
		float prev_yaw = cur;
		float last_target_dist = 99999.0f; // overshoot protection
		float bwd_diffn_delta = 0;

		if((!isRight && isFwd) || (isRight && !isFwd) ) //increase
		{
			if((req + cur) > 179) target_yaw = -180 + (req - (180 - cur));
			else target_yaw = req + cur;
		}
		else
		{
			if((cur - req) < -179) target_yaw = 180 - (req + (-180 - cur));
			else target_yaw = cur - req;
		}

		do{
			if (abs(target_yaw - cur) < 45 ) {
				if(isRight) lmotor->setSpeed((uint32_t)map(abs(target_yaw - cur), 45, 0, 30, 15), isFwd);

				else rmotor->setSpeed((uint32_t)map(abs(target_yaw - cur), 45, 0, 30, 15), isFwd);
			}
			else if(fmod(abs(abs(target_yaw) - abs(cur)), 180) < 45 )
			{
				if(isRight) lmotor->setSpeed((uint32_t)map(fmod(abs(abs(target_yaw) - abs(cur)), 180), 45, 0, 30, 15), isFwd);

				else rmotor->setSpeed((uint32_t)map(fmod(abs(abs(target_yaw) - abs(cur)), 180), 45, 0, 30, 15), isFwd);
			}

			timeNow = HAL_GetTick();
			/* Use backward differentiation algorithm here to estimate the current yaw based on time
			 * elapsed since last sample.
			 * Attempting to increase the gyro sample rate is worse because the drift errors pile up.
			 * Since we dont want to measure changes in sgn(cur - prev yaw) anyway, this method seems fine.
			 *
			 * abs(sensor_data.yaw_abs - sensor_data.yaw_abs_prev) is STEP SIZE
			 * 50 is TIME PER STEP
			 * sgn(sensor_data.yaw_abs - sensor_data.yaw_abs_prev) is DIRECTION
			 *
			 * */
			if(timeNow != sensor_data.yaw_abs_time)
				bwd_diffn_delta = abs(sensor_data.yaw_abs - sensor_data.yaw_abs_prev) * (float)(abs(timeNow - sensor_data.yaw_abs_time)/80);
			else
				bwd_diffn_delta = 0;
			cur = sensor_data.yaw_abs +  (bwd_diffn_delta * sgn(sensor_data.yaw_abs - sensor_data.yaw_abs_prev)); // already dlpf and qtn filtered
			sensor_data.yaw_cur_dbg = cur;
			prev_yaw = cur;
			//break off immediately if overshoot
			if (last_target_dist < abs(target_yaw - cur) && abs(target_yaw - cur) < 15) {
				lmotor->halt();
				rmotor->halt();
				break;
			}
			else last_target_dist = abs(target_yaw - cur);

			if (abs(target_yaw - cur) <= 0.375 || (abs(target_yaw - cur) <= 1.5 && arc) || (HAL_GetTick() - timeStart) > 10000)
			{
				sensor_data.last_halt_val = ((uint32_t)abs(target_yaw - cur)) %180;
				lmotor->halt();
				rmotor->halt();
				break;
			}

			sensor_data.last_halt_val = arg;
			osDelay(2);
			osThreadYield(); // need to ensure yield for the sensortask

		} while (1);


		// LAST MINUTE CHANGE
//		if (!isRight && isFwd){
//			MotionController::move(true, 5, 100, true, false);
// 		    sensor_data.is_moving = true;
//		}
//
//		if (isRight && isFwd){
//			MotionController::move(true, 5, 100, true, false);
// 		    sensor_data.is_moving = true;
//		}

		lmotor->halt();
		rmotor->halt();
		emergency = false;
		sensor_data.is_moving = false;
	}

	void MotionController::moveAndTurnAfterObstacle(bool isRight, bool isFwd, bool arc, uint32_t arg) {
		sensor_data.is_moving = true;
		emergency = false;
		float ir_threshold = 20.0f;
		sensor_data.last_halt_val = 0;

		servo->turnFront();
			osDelay(400);

		uint32_t dist_travelled = 0;
		uint32_t l_encoder_count = lencoder->getCount();
		uint32_t r_encoder_count = rencoder->getCount();
		double target = (double) arg / DISTANCE_PER_ENCODER_PULSE;

		double cur_left = 0, cur_right = 0;
		float count_left = 0, count_right = 0;

		sensor_data.target = target;
		sensor_data.cur_left = cur_left;
		sensor_data.cur_right = cur_right;


