J0JIng/MDP-GRP13-2025/stm/STM32_MDP_Code/STM32_MDP_Code/Core/Src/app_motion.cpp
	void MotionController::emergencyStop() {
		emergency = true;
	}

	/* SERVO LOGIC */
	Servo::Servo(TIM_HandleTypeDef *ctrl, uint32_t channel, uint32_t min,
			uint32_t max, uint32_t center) {
		this->htimer = ctrl;
		this->channel = channel;
		this->MIN_PWM = min;
		this->MAX_PWM = max;
		this->CTR_PWM = center;
		HAL_TIM_PWM_Start(ctrl, channel);
	}

	void Servo::turnLeft() {
		// default behaviour preserved but delegate to turnToPos
		turnToPos(MIN_PWM);
	}
	void Servo::turnRight() {
		turnToPos(MAX_PWM);
	}

	void Servo::turnFront() {
		turnToPos(CTR_PWM);
	}

	void Servo::turnToPos(uint32_t count) {
		if (count < MIN_PWM) count = MIN_PWM;
		if (count > MAX_PWM) count = MAX_PWM;
		this->htimer->Instance->CCR1 = count;
		// small delay so frequent micro-adjustments can occur while moving
		osDelay(10);
	}


	/* MOTOR LOGIC */
	Motor::Motor(TIM_HandleTypeDef *ctrl,
			uint32_t channelA,
			uint32_t channelB,
			uint32_t max_period
	) {

		this->htimer = ctrl;
		this->channelA = channelA;
		this->channelB = channelB;
		this->max_period = max_period;
		this->cur_value = max_period;

		HAL_TIM_PWM_Start(ctrl, channelA);
		HAL_TIM_PWM_Start(ctrl, channelB);
	}

	bool Motor::setSpeed(uint32_t percent, bool isFwd) {
		if (percent > 100){
			return false;
		}
		uint32_t value = this->max_period / 100 * percent;
		this->cur_value = value;

		if (isFwd){
			__HAL_TIM_SetCompare(this->htimer, this->channelA, value);
			__HAL_TIM_SetCompare(this->htimer, this->channelB, 1);
		} else {
			__HAL_TIM_SetCompare(this->htimer, this->channelA, 1);
			__HAL_TIM_SetCompare(this->htimer, this->channelB, value);
		}

		return true;
	}

	bool Motor::_setDutyCycleVal(uint32_t dc, bool isFwd) {
		if (dc > this->max_period){
			return false;
		}
		this->cur_value = dc;

		if (isFwd){
			__HAL_TIM_SetCompare(this->htimer, this->channelA, dc);
			__HAL_TIM_SetCompare(this->htimer, this->channelB, 1);
		} else {
			__HAL_TIM_SetCompare(this->htimer, this->channelA, 1);
			__HAL_TIM_SetCompare(this->htimer, this->channelB, dc);
		}

		return true;
	}

	void Motor::halt() {
		__HAL_TIM_SET_COMPARE(this->htimer, this->channelA, 1);
		__HAL_TIM_SET_COMPARE(this->htimer, this->channelB, 1);
	}

	void Motor::setForward() {
		__HAL_TIM_SetCompare(this->htimer, this->channelA, this->max_period);
		__HAL_TIM_SetCompare(this->htimer, this->channelB, 1);
	}

	void Motor::setBackward() {
		__HAL_TIM_SetCompare(this->htimer, this->channelA, 1);
		__HAL_TIM_SetCompare(this->htimer, this->channelB, this->max_period);
	}


	/* ENCODER LOGIC */
	Encoder::Encoder(TIM_HandleTypeDef *ctrl, uint32_t channel) {

		this->htimer = ctrl;
		this->channel = channel;
		HAL_TIM_Encoder_Start(ctrl, channel);

	}

	uint32_t Encoder::getCount(void) {
		return (uint32_t) __HAL_TIM_GET_COUNTER(this->htimer);
	}

	uint32_t Encoder::getDelta(uint32_t ct1, uint32_t ct2) {
		if (__HAL_TIM_IS_TIM_COUNTING_DOWN(this->htimer)) {
			if (ct2 <= ct1) {
				return ct1 - ct2;
			} else {
				return (65535 - ct2) + ct1;
			}
		} else {
			if (ct2 >= ct1) {
				return ct2 - ct1;
			} else {
				return (65535 - ct1) + ct2;
			}
		}
	}

}
